@авторизация @авторизация.feature
Функция: Авторизация на сайте

@critical @positive
Сценарий: Я авторизуюсь с существующим логином и паролем
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина валидными данными:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "BAw23f5m"             |
И нажимаю "кнопку Войти"
Тогда я понимаю, что авторизован, так как вижу "профиль Пользователя"

@critical @negative
Сценарий: Я ввожу неверный пароль
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "wrongpassword"        |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Ошибка авторизации: Некорректный email / пароль"

@medium @negative
Сценарий: Я оставляю поле логина пустым
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение    |
| логин Email  | ""          |
| логин Пароль | "BAw23f5m"  |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Ошибка авторизации: Некорректный email / пароль"

@medium @negative
Сценарий: Я оставляю поле пароля пустым
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | ""                     |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Ошибка авторизации: Некорректный email / пароль"

@medium @negative
Сценарий: Я оставляю оба поля пустыми
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И оставляю форму логина пустой
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Ошибка авторизации: Некорректный email / пароль"

@medium @negative
Сценарий: Я ввожу логин без символа '@'
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | test1usertestmail.com  |
| логин Пароль | "BAw23f5m"             |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "«Электронная почта» не является правильным email адресом"

@medium @negative
Сценарий: Я ввожу логин с пробелами
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение                 |
| логин Email  | "test user@testmail.com" |
| логин Пароль | "BAw23f5m"               |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "«Электронная почта» не является правильным email адресом"

@medium @negative
Сценарий: Я ввожу логин с особыми символами
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение                  |
| логин Email  | "test!user@testmail.com"  |
| логин Пароль | "BAw23f5m"                |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "«Электронная почта» не является правильным email адресом"

@medium @negative
Сценарий: Я ввожу логин минимальной длины
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение          |
| логин Email  | "a@b.co"          |
| логин Пароль | "BAw23f5m"        |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "«Электронная почта» не является правильным email адресом"

@medium @negative
Сценарий: Я ввожу пароль минимальной длины
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "12345"                |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Некорректный email / пароль"

@medium @negative
Сценарий: Я ввожу логин максимальной длины
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение                                                               |
| логин Email  | "verylongemailaddress12345678901234567890123456789012345@testmail.com" |
| логин Пароль | "BAw23f5m"                                                             |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Недопустимая длина поля Логин"

@medium @negative
Сценарий: Я ввожу пароль максимальной длины
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "BAw23f5mBAw23f5mBAw23f5mBAw23f5mBAw23f5mBAw23f5m" |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Некорректный email / пароль"

@medium @negative
Сценарий: Я ввожу логин без точки в домене
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение               |
| логин Email  | "test1user@testmailcom"|
| логин Пароль | "BAw23f5m"             |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "«Электронная почта» не является правильным email адресом"

@low @positive
Сценарий: Я восстанавливаю пароль
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И нажимаю на ссылку "Забыли пароль?"
И ввожу email "test1user@testmail.com"
И ввожу капчу
И нажимаю "кнопку Восстановить"
Тогда я вижу сообщение "Письмо для восстановления пароля отправлено"

@low @positive
Сценарий: Я вставляю текст из буфера обмена
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И вставляю текст в форму логина:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "BAw23f5m"             |
И нажимаю "кнопку Войти"
Тогда я понимаю, что авторизован, так как вижу "профиль Пользователя"

@critical @negative
Сценарий: Я проверяю защиту от HTML, XSS и SQL-инъекций
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И заполняю форму логина данными:
| элемент      | значение                        |
| логин Email  | "<script>alert('xss')</script>" |
| логин Пароль | "' OR '1'='1"                   |
И нажимаю "кнопку Войти"
Тогда я вижу сообщение об ошибке "Некорректный email / пароль"

@critical @negative
Сценарий: Я блокируюсь после N-попыток неверного входа
Пусть я открываю сайт "https://stellantis.autocrm.ru/"
И многократно ввожу неверные данные:
| элемент      | значение               |
| логин Email  | test1user@testmail.com |
| логин Пароль | "wrongpassword"        |
И нажимаю "кнопку Войти" более N раз
Тогда я вижу сообщение "Ваш аккаунт заблокирован. Попробуйте позже."

